app/views/articles/_comments.html.erb

    </div class="col-xs-6">
    <%= @article.comments.count %>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`article_id` = 25
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 25