app/controllers/articles_controller.rb

SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles`
---
  def index

  # todos los registros
    @articles =  Article.paginate(page: params[:page],per_page:10).ultimos

UPDATE `articles` SET `visits_count` = 1, `updated_at` = '2017-02-17 13:47:50' WHERE `articles`.`id` = 9
---
  def show
    @article.update_visits_count

SELECT `categories`.* FROM `categories`
---
  def new
    @article = Article.new
    @categories = Category.all

INSERT INTO `articles` (`title`, `body`, `visits_count`, `created_at`, `updated_at`, `user_id`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`) VALUES ('crear articulo con potada ', 'nuevo articulo de base de datos en este blog personal ', 0, '2017-02-17 17:34:03', '2017-02-17 17:34:03', 1, 'images.jpeg', 'image/jpeg', 6830, '2017-02-17 17:34:02')
INSERT INTO `has_categories` (`article_id`, `category_id`, `created_at`, `updated_at`) VALUES (13, 3, '2017-02-20 20:35:13', '2017-02-20 20:35:13')
---
  def create
      @article = current_user.articles.new(article_params)
      @article.categories = params[:categories]
      if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 6
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy  #destroy eliminar el objeto de la bd

UPDATE `articles` SET `title` = 'primer articulo!!!!!!', `updated_at` = '2017-02-14 16:39:03' WHERE `articles`.`id` = 1
---
  def update
    if @article.update(article_params)