app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `article_id`, `body`, `created_at`, `updated_at`) VALUES (1, 1, 'hola mundo :)', '2017-02-16 14:35:10', '2017-02-16 14:35:10')
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save

UPDATE `comments` SET `body` = 'hola mundo otra ves!!!!', `updated_at` = '2017-02-16 14:38:47' WHERE `comments`.`id` = 2
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @comment.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
    def set_article
      @article = Article.find(params[:article_id])