app/views/categories/show.html.erb

SELECT `articles`.* FROM `articles` INNER JOIN `has_categories` ON `articles`.`id` = `has_categories`.`article_id` WHERE `has_categories`.`category_id` = 4
---
<h2>Articulos</h2>
<% @category.articles.each do |article| %>